Delans-TLE/src/InformationRegisters/NS_APIАвторизация/NS_APIАвторизация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>NS_APIАвторизация</name>
  <resources>
    <name>АдресПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>SSL</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Delans-TLE/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <predefined>
    <items>
      <name>ОсновнаяОрганизация</name>
      <description>Наша фирма</description>
    </items>
  </predefined>
  <attributes>
    <name>БанковскийСчетПоУмолчанию</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбменаСКонтролирующимиОрганами</name>
    <type>
      <types>EnumRef.УдалитьВидыОбменаСКонтролирующимиОрганами</types>
      <types>EnumRef.ВидыОбменаСКонтролирующимиОрганами</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУчетаСтраховыхВзносов</name>
    <type>
      <types>EnumRef.ВидыУчетаСтраховыхВзносов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИностраннаяОрганизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИПИспользуетТрудНаемныхРаботников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяОтчетность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаПоУмолчанию</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОрганаПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКОПФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКФС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганаПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганаФСГС</name>
    <comment>Код территориального органа государственной статистики </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганаФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрупнейшийНалогоплательщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПлательщикаПриПеречисленииНалогов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТерриториальногоОрганаФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДСВключатьВСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьГлавногоБухгалтера</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерПФР_ИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтавкаНДСПоУмолчанию</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойНомерПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифНаТравматизм</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьGCP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьGLN</name>
    <type>
      <types>DefinedType.GLN</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьОбмена</name>
    <type>
      <types>CatalogRef.УдалитьУчетныеЗаписиДокументооборота</types>
      <types>CatalogRef.УчетныеЗаписиДокументооборота</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЛоготип</name>
    <type>
      <types>CatalogRef.ОрганизацииПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлФаксимильнаяПечать</name>
    <type>
      <types>CatalogRef.ОрганизацииПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойИндексОбособленногоПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтавкиНДСПоУмолчанию</name>
    <type>
      <types>EnumRef.ВидыСтавокНДС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Delans-TLE/src/InformationRegisters/NS_APIАвторизация/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиКомандФормы
//{[+]EFSOL, Козлов Максим 28.05.2019 21:10:20
&НаКлиенте
Процедура ПечатьQR(Команда)
	
	ВыбранныеСтроки = Элементы.Список.ТекущиеДанные;
	Ключ = Новый Структура;
	Ключ.Вставить("Договор", ВыбранныеСтроки.Договор);
	Ключ.Вставить("Контрагент", ВыбранныеСтроки.Контрагент);
		
	МассивСтрок = ПолучитьСтрокуQR(Ключ);
	мТабДок = Новый ТабличныйДокумент;
	мТабДок.АвтоМасштаб = Истина;
	Итератор = 1;
	КоличествоЭлем = МассивСтрок.Количество();
	Для Каждого СТ_Элем Из МассивСтрок Цикл
		QRСтрока = СТ_Элем.СтрокаQR;
		ТекстОшибки = "";
		Ответ = ЗаполнитьТабдок(QRСтрока,ТекстОшибки,мТабДок,КоличествоЭлем,Итератор);
		Итератор = Итератор + 1;
	КонецЦикла;
	
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("QRКод");
    ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "QRКод");
    ПечатнаяФорма.СинонимМакета = "QR Код";
    ПечатнаяФорма.ТабличныйДокумент = Ответ.ТабДок;
    ПечатнаяФорма.ИмяФайлаПечатнойФормы = "QRКод";
    
    ОбластиОбъектов = Новый СписокЗначений;
    УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);

КонецПроцедуры
//}28.05.2019 21:10:20 EFSOL 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//{[+]EFSOL, Козлов Максим 28.05.2019 21:10:54
&НаСервере
Функция ПолучитьСтруктуруСтроки()
	мОтвет = Новый Структура;
	мОтвет.Вставить("АдресПодключения");
	мОтвет.Вставить("ИмяБазы");
	мОтвет.Вставить("SSL");
	мОтвет.Вставить("Пользователь");
	мОтвет.Вставить("Пароль");
	мОтвет.Вставить("usrЛогин");
	мОтвет.Вставить("usrПароль");
	мОтвет.Вставить("МенеджерКонтактноеЛицо");
	мОтвет.Вставить("МенеджерТелефон");
	мОтвет.Вставить("МенеджерEmail");
	Возврат мОтвет;
КонецФункции

&НаСервере
Функция ПолучитьСтрокуQR(Ключ)
	мОтвет = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	NS_APIАвторизация.АдресПодключения КАК АдресПодключения,
	               |	NS_APIАвторизация.ИмяБазы КАК ИмяБазы,
	               |	NS_APIАвторизация.SSL КАК SSL,
	               |	NS_APIАвторизация.Пользователь КАК Пользователь,
	               |	NS_APIАвторизация.ПарольПользователя КАК Пароль,
	               |	NS_APIАвторизация.Логин КАК usrЛогин,
	               |	NS_APIАвторизация.Пароль КАК usrПароль
	               |ИЗ
	               |	РегистрСведений.NS_APIАвторизация КАК NS_APIАвторизация
	               |ГДЕ
	               |	NS_APIАвторизация.Контрагент = &Контрагент
	               |	И NS_APIАвторизация.Договор = &Договор";
	Запрос.УстановитьПараметр("Контрагент",Ключ.Контрагент);
	Запрос.УстановитьПараметр("Договор",Ключ.Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ОбработкаJSON = Обработки.JSON_and_UnJSON.Создать();
	Пока Выборка.Следующий() Цикл
		мСтруктураСтроки = ПолучитьСтруктуруСтроки();
		мСтруктураОтвета = Новый Структура;
		ЗаполнитьЗначенияСвойств(мСтруктураСтроки,Выборка);
		ПользовательИБ = ES_БиллингСервер.ОпределитьПользователяИБ(Выборка.Пользователь);
		мСтруктураСтроки.Пользователь = ?(ТипЗнч(ПользовательИБ) = Тип("ПользовательИнформационнойБазы"), ПользовательИБ.Имя, ПользовательИБ);
		
		мСтруктураСтроки.МенеджерКонтактноеЛицо = Константы.ES_МенеджерКонтактноеЛицо.Получить();
		мСтруктураСтроки.МенеджерТелефон = Константы.ES_МенеджерТелефон.Получить();
		мСтруктураСтроки.МенеджерEmail = Константы.ES_МенеджерEmail.Получить();
		
		СтрокаQR 	= ОбработкаJSON.JSON(мСтруктураСтроки);
		
		//{[+]EFSOL, Козлов Максим EFSOL 28.06.2019 9:52:00
		ЗагрузитьФайлАльтернативнойАвторизации(СтрокаQR, мСтруктураСтроки.usrЛогин);
		//}28.06.2019 9:52:00 EFSOL
		
		СтрокаQR	= ES_ОбщегоНазначения.ЗакодироватьСтрокуВДД(СтрокаQR);
		мСтруктураОтвета.Вставить("СтрокаQR",СтрокаQR);
		мОтвет.Добавить(мСтруктураОтвета);
	КонецЦикла;
		
	Возврат мОтвет;

КонецФункции

//{[+]EFSOL, Козлов Максим 28.06.2019 9:51:32
&НаСервере
Процедура ЗагрузитьФайлАльтернативнойАвторизации(Знач СтруктураДанных, Знач Логин)
	ОбластьДанных = ПараметрыСеанса.ОбластьДанныхЗначение;
	Телефон = Логин;
	ТекстФайла = СтруктураДанных;
	ИмяФайлаДанных = СтрШаблон("%1_%2.xml", ОбластьДанных, Телефон);
	ИмяФайлаДанных = СокрЛП(СтрЗаменить(ИмяФайлаДанных, "+", ""));
	ИмяФайлаДанных = СокрЛП(СтрЗаменить(ИмяФайлаДанных, "(", ""));
	ИмяФайлаДанных = СокрЛП(СтрЗаменить(ИмяФайлаДанных, ")", ""));
	ИмяФайлаДанных = СокрЛП(СтрЗаменить(ИмяФайлаДанных, "-", ""));
	ИмяФайлаДанных = СокрЛП(СтрЗаменить(ИмяФайлаДанных, Символы.НПП, ""));
	ИмяСервера = Константы.ES_СерверАльтАвторизации.Получить();
	ИмяРесурса = Константы.ES_СерверАльтАвторизацииРесурс.Получить();
	Токен = Константы.ES_СерверАльтАвторизацииТокен.Получить();
	
	Попытка
		Соединение = Новый HTTPСоединение(?(ЗначениеЗаполнено(ИмяСервера), ИмяСервера, "ext-dev.delans.ru"));
	Исключение
		        	
	КонецПопытки;
	Заголовки = Новый Соответствие;
	Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	Заголовки.Вставить("Content-Type",  "multipart/form-data; boundary=" + Boundary);

	Запрос = Новый HTTPЗапрос(СтрШаблон("/%1?token=%2&method=upload",                              // /xml-handling.php?token=d8e933a2be47c9498938e5c7eb84838e&method=upload
									?(ЗначениеЗаполнено(ИмяРесурса), ИмяРесурса, "xml-handling.php"),
									?(ЗначениеЗаполнено(Токен), Токен, "d8e933a2be47c9498938e5c7eb84838e")),
						Заголовки);
			
	Поток = Новый ПотокВПамяти;
	Текст = Новый ЗаписьТекста(Поток,КодировкаТекста.UTF8);
	Текст.Записать(ТекстФайла);
	Текст.Закрыть();

	ДДТекста = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
	xml = Новый ЗаписьXML;
	xml.УстановитьСтроку();
	ЗаписатьXML(xml, ДДТекста);
	СтрокаXml = xml.Закрыть();
	
	СтрокаТела = "--" + Boundary + 
			Символы.ПС + "Content-Disposition: form-data; name=""toupload""; filename=""" + ИмяФайлаДанных + """" + 
			Символы.ПС + "Content-Type: application/x-zip-compressed" + Символы.ПС +  
			Символы.ПС + СтрокаXml +                //Передаст содержимое JSON строки в Base64 в виде xml
			Символы.ПС + "--" + Boundary;
			
	
	Запрос.УстановитьТелоИзСтроки(СтрокаТела);
	Результат = Соединение.ОтправитьДляОбработки(Запрос).ПолучитьТелоКакСтроку(); 
	Если Результат = "" Тогда  //В документации не описаны коды ошибок и возможные ответы сервера
		Сообщить("Файл альтернативной авторизации успешно создан/обновлен");
	Иначе 
		Сообщить("Загрузка файла альтернативной авторизации завершилась с ошибкой:
					| " + Результат);
	КонецЕсли; 
КонецПроцедуры
//}28.06.2019 9:51:32 EFSOL

&НаСервере
Функция ЗаполнитьТабдок(QRСтрока,ТекстОшибки,мТабДок,КоличествоЭлем,Итератор)

	мМакет = РегистрыСведений.NS_APIАвторизация.ПолучитьМакет("МакетНастроек");
	ОбластьМакета = мМакет.ПолучитьОбласть("ОбластьQR");
	
	СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Справочники.Организации.ОсновнаяОрганизация, ТекущаяДата());

	
	ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRСтрока, 0, 300);
	
	КартинкаQRКода = Новый Картинка(ДанныеQRКода);
	
	ОбластьМакета.Рисунки.КартинкаQR.Картинка = КартинкаQRКода;
	ОбластьМакета.Рисунки.Лого.Картинка = Новый Картинка(РаботаСФайлами.ДвоичныеДанныеФайла(Справочники.Организации.ОсновнаяОрганизация.ФайлЛоготип, Ложь));
	
	ОбластьМакета.Параметры.Реквизиты = СтрЗаменить(УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,"), 
													" ИНН",
													Символы.ПС + "ИНН"); 
	ОбластьМакета.Параметры.менеджер = Константы.ES_МенеджерКонтактноеЛицо.Получить();
	ОбластьМакета.Параметры.email =  Константы.ES_МенеджерEmail.Получить();
	//ОбластьМакета.Параметры.сайт = "модный сайт, только чей?";
	ОбластьМакета.Параметры.телефон = Константы.ES_МенеджерТелефон.Получить();

	мТабДок.Вывести(ОбластьМакета);
	
	Если не КоличествоЭлем = Итератор Тогда 
		мТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;	
	
	мСтрукт = Новый Структура;
	мСтрукт.Вставить("ТабДок",мТабДок);
	
	Возврат мСтрукт;

КонецФункции
//}28.05.2019 21:10:54 EFSOL 
#КонецОбласти
